backendfile/taurus.yml
execution:
- concurrency: 10 # usuarios 
  ramp-up: 10s # tiempo de aceleración = 1 min
  hold-for: 1m # duración de la prueba = 2 minutos
  #throughput: 1000 # limitamos a 1000 solicitudes por segundo
  #steps: 10 # numero de pasos, se distribuye el rendimiento entre los pasos y la aceleración definida.
  scenario: get-requests # escenario a ejecutar
 

scenarios:
  get-requests:
    requests:
    - url: http://localhost:5000
      method: GET

    - url: http://localhost:5000/clientes
      method: GET

    - url: http://localhost:5000
      method: POST